In [1]:
import numpy as np
import pandas as pd

In [2]:
!wget https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv

--2021-08-24 10:15:23--  https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.110.133, 185.199.111.133, 185.199.108.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.110.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 2649320 (2.5M) [text/plain]
Saving to: ‘fuel_ferc1.csv’

fuel_ferc1.csv      100%[===================>]   2.53M  --.-KB/s    in 0.02s

2021-08-24 10:15:24 (161 MB/s) - ‘fuel_ferc1.csv’ saved [2649320/2649320]

In [3]:
df = pd.read_csv('fuel_ferc1.csv')

In [4]:
df.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

**Question 1**

If you’re given two lists:

A = [1,2,3,4,5,6], B = [13, 21, 34]

The task is to create a list with the elements of A and B in a single dimension with output:

A_B = [1,2,3,4,5,6,13, 21, 34]

Which of the following option is the best way to create this list?

In [9]:
A = [1,2,3,4,5,6]
B = [13,21,34]

In [10]:
A.append(B)

In [11]:
A

[1, 2, 3, 4, 5, 6, [13, 21, 34]]

In [6]:
A = [1,2,3,4,5,6]
B = [13,21,34]
A.extend(B)

In [7]:
A

[1, 2, 3, 4, 5, 6, 13, 21, 34]

**Question 2**

How do you create an identity matrix in python?

In [14]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [15]:
np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [16]:
df.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [18]:
df.describe()

       utility_id_ferc1  ...  fuel_cost_per_mmbtu
count      29523.000000  ...         29523.000000
mean         118.601836  ...            19.304354
std           74.178353  ...          2091.540939
min            1.000000  ...           -41.501000
25%           55.000000  ...             1.940000
50%          122.000000  ...             4.127000
75%          176.000000  ...             7.745000
max          514.000000  ...        359278.000000

[8 rows x 7 columns]

**Question 3**

Which of the following fuel type code has the lowest average fuel cost per unit burned?

In [21]:
df.groupby('fuel_type_code_pudl').mean()['fuel_cost_per_unit_burned']

fuel_type_code_pudl
coal         67.421830
gas          13.659397
nuclear    4955.157002
oil         168.877086
other        18.253856
waste        19.518122
Name: fuel_cost_per_unit_burned, dtype: float64

**Question 4**

What is the standard deviation and 75th percentile of the measure of energy per unit (Fuel_mmbtu_per_unit) in two decimal places?

In [43]:
round(df.fuel_mmbtu_per_unit.describe(), 2)

count    29523.00
mean         8.49
std         10.60
min          0.00
25%          1.02
50%          5.76
75%         17.01
max        341.26
Name: fuel_mmbtu_per_unit, dtype: float64

**Question 5**

What is the skewness and kurtosis for the fuel quantity burned in two decimal places?

In [47]:
round(df.skew().fuel_qty_burned, 2), round(df.kurtosis().fuel_qty_burned, 2)

(15.85, 651.37)

**Question 6**

Which feature has missing values and what is the total number of missing value and percentage of the missing rows as a factor of the total number of rows in three decimal places?

In [25]:
df.isna().sum()

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [65]:
(df.isna().sum() * 100 / len(df)).round(3)

record_id                       0.00
utility_id_ferc1                0.00
report_year                     0.00
plant_name_ferc1                0.00
fuel_type_code_pudl             0.00
fuel_unit                       0.61
fuel_qty_burned                 0.00
fuel_mmbtu_per_unit             0.00
fuel_cost_per_unit_burned       0.00
fuel_cost_per_unit_delivered    0.00
fuel_cost_per_mmbtu             0.00
dtype: float64

**Question 8**

Which of the features has the second and third lowest correlation with the Fuel Cost Per Unit Burned?

In [37]:
correlation = df.corr()
correlation['fuel_cost_per_unit_burned'].sort_values(ascending=True)

utility_id_ferc1               -0.037863
fuel_qty_burned                -0.018535
fuel_mmbtu_per_unit            -0.010034
fuel_cost_per_mmbtu            -0.000437
fuel_cost_per_unit_delivered    0.011007
report_year                     0.013599
fuel_cost_per_unit_burned       1.000000
Name: fuel_cost_per_unit_burned, dtype: float64

**Question 9**

For the fuel type coal, what is the percentage change in the fuel cost per unit burned in 1998 compared to 1994?

In [58]:
fuel_cost_per_unit_burned_1998 = df.query("fuel_type_code_pudl == 'coal' and report_year == 1998")['fuel_cost_per_unit_burned'].sum()
fuel_cost_per_unit_burned_1994 = df.query("fuel_type_code_pudl == 'coal' and report_year == 1994")['fuel_cost_per_unit_burned'].sum()

(fuel_cost_per_unit_burned_1998 - fuel_cost_per_unit_burned_1994) * 100 / fuel_cost_per_unit_burned_1994

-20.56765451826053

In [59]:
fuel_cost_per_unit_burned_1998, fuel_cost_per_unit_burned_1994

(11902.597, 14984.572000000002)

**Question 10**

Which year has the highest average fuel cost per unit delivered?

In [52]:
df.groupby('report_year').mean()['fuel_cost_per_unit_delivered'].sort_values(ascending=False)

report_year
1997    11140.197239
1996     9196.705948
2000      985.362877
2009      652.694163
2018      499.269966
2015      326.535511
1998      287.154420
2014      192.737183
2013      172.307591
2004      139.524275
2016      103.901761
2010       91.862105
1994       63.636060
2012       60.994502
2001       60.050396
2011       59.774667
2008       58.588197
2003       55.663493
2002       47.594361
2017       46.196861
2007       43.325023
2005       41.438184
2006       38.657484
1995       32.735269
1999       25.551627
Name: fuel_cost_per_unit_delivered, dtype: float64